/* Done Button for closing the mini browser */
"i18N_YMB_Done_Button" = "סיום";

/* Pop up menu action label */
"i18N_YMB_Search_Popup_Label" = "חפש";

/* Open in safari action label */
"i18N_YMB_Share_Action_Open_in_Safari" = "פתח ב Safari";

/* Browser Back accessibility label */
"i18N_YMB_back_access_label" = "חזור אחורה.";

/* Browser Back accessibility hint */
"i18N_YMB_back_access_hint" = "הקש פעמיים כדי לחזור לדף האינטרנט הקודם.";

/* Browser share button accessibility label */
"i18N_YMB_share_access_label" = "שתף.";
